# MySQL Table Relationships and SQL Concepts: ORDER BY, GROUP BY, MAX, DISTINCT, and COUNT

In [ ]:
# Install necessary packages
%pip install jupyter ipython-sql mysql-connector-python sqlalchemy pymysql prettytable cryptography

# Load the ipython-sql extension
%load_ext sql

# Connect to the postgres database  
%sql mysql+pymysql://root:root@localhost:3308/mydatabase

# Configure ipython-sql to use a valid PrettyTable style
%config SqlMagic.style = '_DEPRECATED_DEFAULT'



## Objectives

1. Understand table relationships:
   - One-to-One
   - One-to-Many
   - Many-to-Many
2. Learn to define and use relationships in MySQL.
3. Use `ORDER BY`, `GROUP BY`, `MAX`, `DISTINCT`, and `COUNT` with practical examples.
4. Combine these concepts for advanced SQL queries.


## Table Schemas and Data

### 1. One-to-One Relationship

**Tables**:
- `users`: Stores user details.
- `user_profiles`: Stores additional user information linked to `users`.  

### users table
| `users` Table Schema |
|-----------------------|
| `user_id` (INT, PK)  |
| `name` (VARCHAR)     |


### user_profiles table
| `user_profiles` Table Schema |
|------------------------------|
| `profile_id` (INT, PK)      |
| `user_id` (INT, UNIQUE, FK) |
| `bio` (TEXT)               |

In [ ]:
%%sql  
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE user_profiles (
    profile_id INT PRIMARY KEY,
    user_id INT UNIQUE, 
    bio TEXT,
    FOREIGN KEY (user_id) REFERENCES users(user_id)
);

 * mysql+pymysql://root:***@localhost:3308/mydatabase
0 rows affected.

[]


### 2. One-to-Many Relationship

**Tables**:
- `departments`: Stores department details.
- `employees`: Stores employee details linked to `departments`.

### departments table

| `departments` Table Schema |
|----------------------------|
| `department_id` (INT, PK)  |
| `name` (VARCHAR)           |

### employees table

| `employees` Table Schema  |
|---------------------------|
| `employee_id` (INT, PK)   |
| `name` (VARCHAR)          |
| `department_id` (INT, FK) |

### salaries table
| `salaries` Table Schema  |
|--------------------------|
| `salary_id` (INT, PK)    |
| `employee_id` (INT, FK)  |
| `amount` (DECIMAL)       |

In [ ]:
%%sql
-- Create the departments table
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    name VARCHAR(100)
);

-- Create the employees table
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(100),
    department_id INT,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

-- Create the salaries table
CREATE TABLE salaries (
    salary_id INT PRIMARY KEY,
    employee_id INT,
    amount DECIMAL(10, 2),
    FOREIGN KEY (employee_id) REFERENCES employees(employee_id)
);

-- Populate the departments table
INSERT INTO departments (department_id, name)
VALUES 
(1, 'Human Resources'),
(2, 'Engineering'),
(3, 'Sales');

-- Populate the employees table
INSERT INTO employees (employee_id, name, department_id)
VALUES 
(1, 'Alice', 1),
(2, 'Bob', 2),
(3, 'Charlie', 2),
(4, 'Diana', 3);

-- Populate the salaries table
INSERT INTO salaries (salary_id, employee_id, amount)
VALUES
(1, 1, 50000.00),
(2, 2, 70000.00),
(3, 3, 80000.00),
(4, 4, 60000.00);

 * mysql+pymysql://root:***@localhost:3308/mydatabase
0 rows affected.
0 rows affected.
0 rows affected.
3 rows affected.
4 rows affected.
4 rows affected.
3 rows affected.

[('Human Resources', Decimal('50000.00')),
 ('Engineering', Decimal('80000.00')),
 ('Sales', Decimal('60000.00'))]


### 3. Many-to-Many Relationship

**Tables**:
- `students`: Stores student details.
- `courses`: Stores course details.
- `enrollments`: Stores enrollment details linking `students` and `courses`.

### students table
| `students` Table Schema |
|-------------------------|
| `student_id` (INT, PK)  |
| `name` (VARCHAR)        |

### courses table

| `courses` Table Schema |
|------------------------|
| `course_id` (INT, PK)  |
| `title` (VARCHAR)      |

### enrollments table

| `enrollments` Table Schema |
|-----------------------------|
| `enrollment_id` (INT, PK)  |
| `student_id` (INT, FK)     |
| `course_id` (INT, FK)      |

In [27]:
%%sql
-- Create and populate tables for Many-to-Many Relationship
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE courses (
    course_id INT PRIMARY KEY,
    title VARCHAR(100)
);

CREATE TABLE enrollments (
    enrollment_id INT PRIMARY KEY,
    student_id INT,
    course_id INT,
    FOREIGN KEY (student_id) REFERENCES students(student_id),
    FOREIGN KEY (course_id) REFERENCES courses(course_id)
);

-- Populate tables
INSERT INTO students (student_id, name) VALUES 
(1, 'Alice'),
(2, 'Bob');

INSERT INTO courses (course_id, title) VALUES 
(1, 'Math'),
(2, 'Science');

INSERT INTO enrollments (enrollment_id, student_id, course_id) VALUES 
(1, 1, 1),
(2, 1, 2),
(3, 2, 1);

 * mysql+pymysql://root:***@localhost:3308/mydatabase
0 rows affected.
0 rows affected.
0 rows affected.
2 rows affected.
2 rows affected.
3 rows affected.

[]


## Advanced SQL Concepts with `GROUP BY`, `MAX`, `DISTINCT`, and `COUNT`

The GROUP BY clause is used in SQL to group rows that have the same values in specified columns into aggregated data. It is typically used with aggregate functions like MAX(), SUM(), AVG(), etc., to perform calculations on each group.

### departments
| department_id | name              |
|---------------|-------------------|
| 1             | Human Resources   |
| 2             | Engineering       |
| 3             | Sales             |

### employees
| employee_id | name    | department_id |
|-------------|---------|---------------|
| 1           | Alice   | 1             |
| 2           | Bob     | 2             |
| 3           | Charlie | 2             |
| 4           | Diana   | 3             |


### salaries

| salary_id | employee_id | amount    |
|-----------|-------------|-----------|
| 1         | 1           | 50000.00 |
| 2         | 2           | 70000.00 |
| 3         | 3           | 80000.00 |
| 4         | 4           | 60000.00 |


### result after aggregation 
| department       | highest_salary |
|------------------|----------------|
| Human Resources  | 50000.00       |
| Engineering      | 80000.00       |
| Sales            | 60000.00       |

In [14]:
%%sql
-- Find the highest salary by department (One-to-Many)
SELECT d.name AS department, MAX(s.amount) AS highest_salary
FROM departments d
JOIN employees e ON d.department_id = e.department_id
JOIN salaries s ON e.employee_id = s.employee_id
GROUP BY d.name;

 * mysql+pymysql://root:***@localhost:3308/mydatabase
3 rows affected.

[('Human Resources', Decimal('50000.00')),
 ('Engineering', Decimal('80000.00')),
 ('Sales', Decimal('60000.00'))]

In [22]:
%%sql
-- Find unique employees by salary (DISTINCT)
SELECT DISTINCT s.amount 
FROM employees e
JOIN salaries s ON e.employee_id = s.employee_id;

 * mysql+pymysql://root:***@localhost:3308/mydatabase
3 rows affected.

[(Decimal('50000.00'),), (Decimal('70000.00'),), (Decimal('60000.00'),)]

In [24]:
%%sql
-- Count employees earning more than 50000
SELECT COUNT(*) AS total_high_earners
FROM salaries
WHERE amount > 50000;

 * mysql+pymysql://root:***@localhost:3308/mydatabase
1 rows affected.

[(2,)]

### students Table
| student_id | name   |
|------------|--------|
| 1          | Alice  |
| 2          | Bob    |

### courses Table
| course_id | title   |
|-----------|---------|
| 1         | Math    |
| 2         | Science |

### enrollments Table
| enrollment_id | student_id | course_id |
|---------------|------------|-----------|
| 1             | 1          | 1         |
| 2             | 1          | 2         |
| 3             | 2          | 1         |



-- Count the number of students enrolled in each course (Many-to-Many)

In [28]:
%%sql
SELECT c.title AS course, COUNT(e.student_id) AS total_students
FROM courses c
JOIN enrollments e ON c.course_id = e.course_id
GROUP BY c.title;

 * mysql+pymysql://root:***@localhost:3308/mydatabase
2 rows affected.

[('Math', 2), ('Science', 1)]